#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_autoscaling_group.asg will be updated in-place
  ~ resource "aws_autoscaling_group" "asg" {
        arn                       = "arn:aws:autoscaling:us-east-1:097091479671:autoScalingGroup:a51f60f9-2752-4785-8eaf-c912a5c8e1f2:autoScalingGroupName/challenge-asg"
        availability_zones        = [
            "us-east-1a",
            "us-east-1b",
            "us-east-1c",
        ]
        capacity_rebalance        = false
        default_cooldown          = 300
        desired_capacity          = 4
        enabled_metrics           = []
        force_delete              = true
        force_delete_warm_pool    = false
        health_check_grace_period = 300
        health_check_type         = "ELB"
        id                        = "challenge-asg"
        launch_configuration      = "challenge_ecs"
        load_balancers            = []
        max_instance_lifetime     = 0
        max_size                  = 5
        metrics_granularity       = "1Minute"
        min_size                  = 4
        name                      = "challenge-asg"
      ~ protect_from_scale_in     = false -> true
        service_linked_role_arn   = "arn:aws:iam::097091479671:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling"
        suspended_processes       = []
        target_group_arns         = [
            "arn:aws:elasticloadbalancing:us-east-1:097091479671:targetgroup/challenge-web-target-group/70a403a8ec33299d",
        ]
        termination_policies      = []
        vpc_zone_identifier       = [
            "subnet-0032eaed32b7bd383",
            "subnet-014a47a9d75f94a1e",
            "subnet-0cb628167db23e5a3",
        ]
        wait_for_capacity_timeout = "10m"

      - tag {
          - key                 = "AmazonECSManaged" -> null
          - propagate_at_launch = true -> null
        }
    }

  # aws_ecs_capacity_provider.test will be created
  + resource "aws_ecs_capacity_provider" "test" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "capacity-provider-test"

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = "arn:aws:autoscaling:us-east-1:097091479671:autoScalingGroup:a51f60f9-2752-4785-8eaf-c912a5c8e1f2:autoScalingGroupName/challenge-asg"
          + managed_termination_protection = "ENABLED"

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = (known after apply)
              + minimum_scaling_step_size = (known after apply)
              + status                    = "ENABLED"
              + target_capacity           = 85
            }
        }
    }

  # aws_ecs_cluster.web-cluster will be created
  + resource "aws_ecs_cluster" "web-cluster" {
      + arn                = (known after apply)
      + capacity_providers = [
          + "capacity-provider-test",
        ]
      + id                 = (known after apply)
      + name               = "aws-app-bucket-sync"
      + tags               = {
          + "createdBy" = "jefferson.moura"
          + "env"       = "dev"
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "EC2"
      + name                               = "web-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = "arn:aws:ecs:us-east-1:097091479671:task-definition/web:2"
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "challenge-web-app"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:097091479671:targetgroup/challenge-web-target-group/70a403a8ec33299d"
        }

      + ordered_placement_strategy {
          + field = "cpu"
          + type  = "binpack"
        }
    }

  # aws_ecs_service.service-worker-1 will be created
  + resource "aws_ecs_service" "service-worker-1" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "EC2"
      + name                               = "service-worker-1"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = "arn:aws:ecs:us-east-1:097091479671:task-definition/worker1:2"
      + wait_for_steady_state              = false

      + ordered_placement_strategy {
          + field = "cpu"
          + type  = "binpack"
        }
    }

  # aws_ecs_service.service-worker-2 will be created
  + resource "aws_ecs_service" "service-worker-2" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "EC2"
      + name                               = "service-worker-2"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = "arn:aws:ecs:us-east-1:097091479671:task-definition/worker2:2"
      + wait_for_steady_state              = false

      + ordered_placement_strategy {
          + field = "cpu"
          + type  = "binpack"
        }
    }

  # aws_ecs_service.service-worker-3 will be created
  + resource "aws_ecs_service" "service-worker-3" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "EC2"
      + name                               = "service-worker-3"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = "arn:aws:ecs:us-east-1:097091479671:task-definition/worker3:2"
      + wait_for_steady_state              = false

      + ordered_placement_strategy {
          + field = "cpu"
          + type  = "binpack"
        }
    }

Plan: 6 to add, 1 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on ecs.tf line 100, in resource "aws_ecs_task_definition" "worker1":
 100:   container_definitions = "${data.template_file.worker1.rendered}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 8 more similar warnings elsewhere)

```

</details>

*Workflow: `Terraform`, Action: `hashicorpterraform-github-actions4`, Working Directory: `terraform`, Workspace: `default`*
